AutoEncoder(
  (encoder): Sequential(
    (0): Linear(in_features=22, out_features=9, bias=True)
    (1): ReLU()
  )
  (decoder): Sequential(
    (0): Linear(in_features=9, out_features=22, bias=True)
    (1): ReLU()
    (2): Sigmoid()
  )
)
